{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v3.12.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "resnet", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 20, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_90", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_90", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_93", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_93", "inbound_nodes": [[["batch_normalization_90", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_87", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_87", "inbound_nodes": [[["conv2d_93", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_91", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_91", "inbound_nodes": [[["re_lu_87", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_45", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "name": "dropout_45", "inbound_nodes": [[["batch_normalization_91", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 16, "downsample": false, "kernel_size": 3}, "name": "res_block_42", "inbound_nodes": [[["dropout_45", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_46", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "name": "dropout_46", "inbound_nodes": [[["res_block_42", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 16, "downsample": false, "kernel_size": 3}, "name": "res_block_43", "inbound_nodes": [[["dropout_46", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_47", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "name": "dropout_47", "inbound_nodes": [[["res_block_43", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 16, "downsample": false, "kernel_size": 3}, "name": "res_block_44", "inbound_nodes": [[["dropout_47", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_48", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "name": "dropout_48", "inbound_nodes": [[["res_block_44", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 16, "downsample": false, "kernel_size": 3}, "name": "res_block_45", "inbound_nodes": [[["dropout_48", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_49", "trainable": true, "dtype": "float32", "rate": 0.15, "noise_shape": null, "seed": null}, "name": "dropout_49", "inbound_nodes": [[["res_block_45", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 32, "downsample": true, "kernel_size": 3}, "name": "res_block_46", "inbound_nodes": [[["dropout_49", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_50", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_50", "inbound_nodes": [[["res_block_46", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 32, "downsample": false, "kernel_size": 3}, "name": "res_block_47", "inbound_nodes": [[["dropout_50", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_51", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_51", "inbound_nodes": [[["res_block_47", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 32, "downsample": false, "kernel_size": 3}, "name": "res_block_48", "inbound_nodes": [[["dropout_51", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_52", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_52", "inbound_nodes": [[["res_block_48", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 32, "downsample": false, "kernel_size": 3}, "name": "res_block_49", "inbound_nodes": [[["dropout_52", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_53", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_53", "inbound_nodes": [[["res_block_49", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 32, "downsample": false, "kernel_size": 3}, "name": "res_block_50", "inbound_nodes": [[["dropout_53", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_54", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_54", "inbound_nodes": [[["res_block_50", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 32, "downsample": false, "kernel_size": 3}, "name": "res_block_51", "inbound_nodes": [[["dropout_54", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_55", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_55", "inbound_nodes": [[["res_block_51", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 64, "downsample": true, "kernel_size": 3}, "name": "res_block_52", "inbound_nodes": [[["dropout_55", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_56", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_56", "inbound_nodes": [[["res_block_52", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 64, "downsample": false, "kernel_size": 3}, "name": "res_block_53", "inbound_nodes": [[["dropout_56", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_57", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_57", "inbound_nodes": [[["res_block_53", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 64, "downsample": false, "kernel_size": 3}, "name": "res_block_54", "inbound_nodes": [[["dropout_57", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_58", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_58", "inbound_nodes": [[["res_block_54", 0, 0, {}]]]}, {"class_name": "Custom>ResBlock", "config": {"filters": 64, "downsample": false, "kernel_size": 3}, "name": "res_block_55", "inbound_nodes": [[["dropout_58", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_59", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout_59", "inbound_nodes": [[["res_block_55", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}, "name": "average_pooling2d_3", "inbound_nodes": [[["dropout_59", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_3", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["flatten_3", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": false, "label_smoothing": 0.0, "axis": -1}}, "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1_new.bin"], "weights": [{"name": "batch_normalization_90/gamma", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_90/beta", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_90/moving_mean", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_90/moving_variance", "shape": [1], "dtype": "float32"}, {"name": "batch_normalization_91/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_91/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_91/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_91/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "conv2d_93/kernel", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "conv2d_93/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [192, 2], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [2], "dtype": "float32"}, {"name": "res_block_42/conv2d_94/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "res_block_42/conv2d_94/bias", "shape": [16], "dtype": "float32"}, {"name": "res_block_42/batch_normalization_92/gamma", "shape": [16], "dtype": "float32"}, {"name": "res_block_42/batch_normalization_92/beta", "shape": [16], "dtype": "float32"}, {"name": "res_block_42/conv2d_95/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "res_block_42/conv2d_95/bias", "shape": [16], "dtype": "float32"}, {"name": "res_block_42/batch_normalization_93/gamma", "shape": [16], "dtype": "float32"}, {"name": "res_block_42/batch_normalization_93/beta", "shape": [16], "dtype": "float32"}, {"name": "res_block_42/batch_normalization_92/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "res_block_42/batch_normalization_92/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "res_block_42/batch_normalization_93/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "res_block_42/batch_normalization_93/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "res_block_43/conv2d_96/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "res_block_43/conv2d_96/bias", "shape": [16], "dtype": "float32"}, {"name": "res_block_43/batch_normalization_94/gamma", "shape": [16], "dtype": "float32"}, {"name": "res_block_43/batch_normalization_94/beta", "shape": [16], "dtype": "float32"}, {"name": "res_block_43/conv2d_97/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "res_block_43/conv2d_97/bias", "shape": [16], "dtype": "float32"}, {"name": "res_block_43/batch_normalization_95/gamma", "shape": [16], "dtype": "float32"}, {"name": "res_block_43/batch_normalization_95/beta", "shape": [16], "dtype": "float32"}, {"name": "res_block_43/batch_normalization_94/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "res_block_43/batch_normalization_94/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "res_block_43/batch_normalization_95/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "res_block_43/batch_normalization_95/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "res_block_44/conv2d_98/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "res_block_44/conv2d_98/bias", "shape": [16], "dtype": "float32"}, {"name": "res_block_44/batch_normalization_96/gamma", "shape": [16], "dtype": "float32"}, {"name": "res_block_44/batch_normalization_96/beta", "shape": [16], "dtype": "float32"}, {"name": "res_block_44/conv2d_99/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "res_block_44/conv2d_99/bias", "shape": [16], "dtype": "float32"}, {"name": "res_block_44/batch_normalization_97/gamma", "shape": [16], "dtype": "float32"}, {"name": "res_block_44/batch_normalization_97/beta", "shape": [16], "dtype": "float32"}, {"name": "res_block_44/batch_normalization_96/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "res_block_44/batch_normalization_96/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "res_block_44/batch_normalization_97/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "res_block_44/batch_normalization_97/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "res_block_45/conv2d_100/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "res_block_45/conv2d_100/bias", "shape": [16], "dtype": "float32"}, {"name": "res_block_45/batch_normalization_98/gamma", "shape": [16], "dtype": "float32"}, {"name": "res_block_45/batch_normalization_98/beta", "shape": [16], "dtype": "float32"}, {"name": "res_block_45/conv2d_101/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "res_block_45/conv2d_101/bias", "shape": [16], "dtype": "float32"}, {"name": "res_block_45/batch_normalization_99/gamma", "shape": [16], "dtype": "float32"}, {"name": "res_block_45/batch_normalization_99/beta", "shape": [16], "dtype": "float32"}, {"name": "res_block_45/batch_normalization_98/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "res_block_45/batch_normalization_98/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "res_block_45/batch_normalization_99/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "res_block_45/batch_normalization_99/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "res_block_46/conv2d_102/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "res_block_46/conv2d_102/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_46/batch_normalization_100/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_46/batch_normalization_100/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_46/conv2d_103/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_46/conv2d_103/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_46/conv2d_104/kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "res_block_46/conv2d_104/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_46/batch_normalization_101/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_46/batch_normalization_101/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_46/batch_normalization_100/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_46/batch_normalization_100/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_46/batch_normalization_101/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_46/batch_normalization_101/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_47/conv2d_105/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_47/conv2d_105/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_47/batch_normalization_102/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_47/batch_normalization_102/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_47/conv2d_106/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_47/conv2d_106/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_47/batch_normalization_103/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_47/batch_normalization_103/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_47/batch_normalization_102/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_47/batch_normalization_102/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_47/batch_normalization_103/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_47/batch_normalization_103/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_48/conv2d_107/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_48/conv2d_107/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_48/batch_normalization_104/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_48/batch_normalization_104/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_48/conv2d_108/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_48/conv2d_108/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_48/batch_normalization_105/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_48/batch_normalization_105/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_48/batch_normalization_104/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_48/batch_normalization_104/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_48/batch_normalization_105/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_48/batch_normalization_105/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_49/conv2d_109/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_49/conv2d_109/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_49/batch_normalization_106/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_49/batch_normalization_106/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_49/conv2d_110/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_49/conv2d_110/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_49/batch_normalization_107/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_49/batch_normalization_107/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_49/batch_normalization_106/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_49/batch_normalization_106/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_49/batch_normalization_107/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_49/batch_normalization_107/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_50/conv2d_111/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_50/conv2d_111/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_50/batch_normalization_108/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_50/batch_normalization_108/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_50/conv2d_112/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_50/conv2d_112/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_50/batch_normalization_109/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_50/batch_normalization_109/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_50/batch_normalization_108/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_50/batch_normalization_108/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_50/batch_normalization_109/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_50/batch_normalization_109/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_51/conv2d_113/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_51/conv2d_113/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_51/batch_normalization_110/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_51/batch_normalization_110/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_51/conv2d_114/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "res_block_51/conv2d_114/bias", "shape": [32], "dtype": "float32"}, {"name": "res_block_51/batch_normalization_111/gamma", "shape": [32], "dtype": "float32"}, {"name": "res_block_51/batch_normalization_111/beta", "shape": [32], "dtype": "float32"}, {"name": "res_block_51/batch_normalization_110/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_51/batch_normalization_110/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_51/batch_normalization_111/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "res_block_51/batch_normalization_111/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "res_block_52/conv2d_115/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "res_block_52/conv2d_115/bias", "shape": [64], "dtype": "float32"}, {"name": "res_block_52/batch_normalization_112/gamma", "shape": [64], "dtype": "float32"}, {"name": "res_block_52/batch_normalization_112/beta", "shape": [64], "dtype": "float32"}, {"name": "res_block_52/conv2d_116/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res_block_52/conv2d_116/bias", "shape": [64], "dtype": "float32"}, {"name": "res_block_52/conv2d_117/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "res_block_52/conv2d_117/bias", "shape": [64], "dtype": "float32"}, {"name": "res_block_52/batch_normalization_113/gamma", "shape": [64], "dtype": "float32"}, {"name": "res_block_52/batch_normalization_113/beta", "shape": [64], "dtype": "float32"}, {"name": "res_block_52/batch_normalization_112/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "res_block_52/batch_normalization_112/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res_block_52/batch_normalization_113/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "res_block_52/batch_normalization_113/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res_block_53/conv2d_118/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res_block_53/conv2d_118/bias", "shape": [64], "dtype": "float32"}, {"name": "res_block_53/batch_normalization_114/gamma", "shape": [64], "dtype": "float32"}, {"name": "res_block_53/batch_normalization_114/beta", "shape": [64], "dtype": "float32"}, {"name": "res_block_53/conv2d_119/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res_block_53/conv2d_119/bias", "shape": [64], "dtype": "float32"}, {"name": "res_block_53/batch_normalization_115/gamma", "shape": [64], "dtype": "float32"}, {"name": "res_block_53/batch_normalization_115/beta", "shape": [64], "dtype": "float32"}, {"name": "res_block_53/batch_normalization_114/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "res_block_53/batch_normalization_114/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res_block_53/batch_normalization_115/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "res_block_53/batch_normalization_115/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res_block_54/conv2d_120/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res_block_54/conv2d_120/bias", "shape": [64], "dtype": "float32"}, {"name": "res_block_54/batch_normalization_116/gamma", "shape": [64], "dtype": "float32"}, {"name": "res_block_54/batch_normalization_116/beta", "shape": [64], "dtype": "float32"}, {"name": "res_block_54/conv2d_121/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res_block_54/conv2d_121/bias", "shape": [64], "dtype": "float32"}, {"name": "res_block_54/batch_normalization_117/gamma", "shape": [64], "dtype": "float32"}, {"name": "res_block_54/batch_normalization_117/beta", "shape": [64], "dtype": "float32"}, {"name": "res_block_54/batch_normalization_116/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "res_block_54/batch_normalization_116/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res_block_54/batch_normalization_117/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "res_block_54/batch_normalization_117/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res_block_55/conv2d_122/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res_block_55/conv2d_122/bias", "shape": [64], "dtype": "float32"}, {"name": "res_block_55/batch_normalization_118/gamma", "shape": [64], "dtype": "float32"}, {"name": "res_block_55/batch_normalization_118/beta", "shape": [64], "dtype": "float32"}, {"name": "res_block_55/conv2d_123/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res_block_55/conv2d_123/bias", "shape": [64], "dtype": "float32"}, {"name": "res_block_55/batch_normalization_119/gamma", "shape": [64], "dtype": "float32"}, {"name": "res_block_55/batch_normalization_119/beta", "shape": [64], "dtype": "float32"}, {"name": "res_block_55/batch_normalization_118/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "res_block_55/batch_normalization_118/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "res_block_55/batch_normalization_119/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "res_block_55/batch_normalization_119/moving_variance", "shape": [64], "dtype": "float32"}]}]}